{
	"projects": 
	[
		{
			"id": 1,
			"title": "The Freshman Experience",
			"date": "January 9",
			"summary": "<p>Every year, thousands of new students come to UCSD to begin their college careers.  Freshman year lays the path for a fruitful college experience, so it is important that the early days of a student's college career help to support their success.</p><p>I interviewed a first-year international student from China.  She expressed disappointment in the guided tour she went on during Freshman Orientation, wishing that they had been given time to explore on their own instead.  While the tour focused on surface information about various campus landmarks, she wanted to know insider information.  Which lecture hall has the cleanest bathroom?  Where is the best hidden study spot?</p><p>This assignment provided a condensed taste of the design process, and placed an emphasis on doing the steps quickly.  Interviewing, needfinding, brainstorming, prototyping, and user testing were all parts of the rapid problem-solving process, in miniature form.</p>",
			"image": "lorempixel.people.1.jpeg"
		},
		{
			"id": 2,
			"title": "Needfinding",
			"date": "January 16",
			"summary": "<p><i>Needfinding</i> is the process of observing a task to find breakdowns, user hacks, and opportunities for improvement.  Through these observations, we can try to deduce user needs.</p><p>I chose to observe and interview students participating in the UCSD Winter Career Fair.  Every student I talked to complained about the crowded room and the inefficiency of waiting in line.  Moreover, many students expressed difficulty with pitching themselves to recruiters.</p>",
			"image": "lorempixel.city.1.jpeg"
		},
		{
			"id": 3,
			"title": "Prototyping",
			"date": "January 23",
			"summary": "<p>This is the first team assignment. Review and share the user needs you brainstormed. This week, you'll flesh out your design ideas by creating a point of view, seeking inspiration, storyboarding, and making paper prototypes. These are the blueprints for the mobile web application you'll make.</p>",
			"image": "lorempixel.technics.1.jpeg"
		},
		{
			"id": 4,
			"title": "Heuristic Evaluation",
			"date": "January 30",
			"summary": "<p>As Carolyn Snyder writes, 'Paper prototyping is a variation of usability testing where the representative users perform realistic tasks by interacting with a paper version of the interface that is manipulated by a person 'playing computer' who doesn't explain how the interface is intended to work.' In this assignment, your group will conduct heuristic evaluations (HEs) of your paper prototypes and you will individually help out other groups by evaluating theirs. This will complete the prototyping phase of the project, providing you with the feedback you need to begin implementing.</p>",
			"image": "lorempixel.abstract.1.jpeg"
		},
		{
			"id": 5,
			"title": "Skeleton and a Plan",
			"date": "February 6",
			"summary": "<p>Review the feedback you got last week from the Heuristic Evaluations of your prototypes. Distill the HE results into a list of concrete changes you want to make to your prototype. Use what worked, and improve what didn't. If you haven't already, make a decision about the prototype you are going with. This could be one of the two you tested or a combination of them. Again, take the time you need. This is what you will be working on for the rest of the course, so make sure you will feel invested in it.</p>",
			"image": "lorempixel.abstract.8.jpeg"
		},
		{
			"id": 6,
			"title": "Meat on the Bones",
			"date": "February 13",
			"summary": "<p>Functionality functionality functionality! Continue developing your interactive prototypes in accordance with your development plan. Also, update your development plan as you discover more about what you want to prioritize, what you can expect to implement, and what you may need to mock up. The goal is for you to complete the interaction flow this week.</p>",
			"image": "lorempixel.people.2.jpeg"
		},
		{
			"id": 7,
			"title": "Ready for Testing",
			"date": "February 20",
			"summary": "<p>Crunch time! Your interactive prototypes have to be <b>ready for user testing</b> by the end of this week.</p>",
			"image": "lorempixel.technics.2.jpeg"
		},
		{
			"id": 8,
			"title": "User Test Results",
			"date": "February 27",
			"summary": "<p>The goal of this assignment is to launch a user test. To get the kinks out of your application, first test it with a couple of in-person users.</p><p>Any questions about this assignment should be posed to the forums and will be answered promptly by the staff.</p>",
			"image": "comingsoon.jpg"
		},
		{
			"id": 9,
			"title": "Results!",
			"date": "March 6",
			"summary": "<p>What did you find in your study?</p>",
			"image": "comingsoon.jpg"
		},	
		{
			"id": 10,
			"title": "Social computing",
			"date": "March 13",
			"summary": "<p>Design for lots of people</p>",
			"image": "comingsoon.jpg"
		},		
		{
			"id": 11,
			"title": "Ubiquitous computing",
			"date": "March 20",
			"summary": "<p>Computers everywhere!</p>",
			"image": "comingsoon.jpg"
		},	
		{
			"id": 11,
			"title": "Design Tools",
			"date": "March 27",
			"summary": "<p>Make design better!</p>",
			"image": "comingsoon.jpg"
		},							
		{
			"id": 12,
			"title": "Final presentation",
			"date": "April 3",
			"summary": "<p>Show the world what you've made!</p>",
			"image": "comingsoon.jpg"
		}	
	]
}